{
  "metadata": {
    "name": "Legal Documents Similarity",
    "description": "Legal text pairs for evaluating semantic similarity in legal domain",
    "task_type": "similarity",
    "domain": "legal",
    "jurisdiction": [
      "US",
      "Common Law"
    ],
    "document_types": [
      "contracts",
      "statutes",
      "case_law",
      "regulations"
    ],
    "created_by": "embedding_framework",
    "version": "1.0"
  },
  "samples": [
    {
      "text1": "The party of the first part agrees to transfer all rights, title, and interest in the aforementioned property to the party of the second part.",
      "text2": "Grantor hereby conveys, transfers, and assigns all ownership rights in the described real estate to Grantee.",
      "label": 0.88,
      "document_type": "contract",
      "legal_concept": "property_transfer",
      "complexity": "medium"
    },
    {
      "text1": "No person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury.",
      "text2": "Criminal prosecution for serious felonies requires formal charges through grand jury proceedings.",
      "label": 0.85,
      "document_type": "constitutional",
      "legal_concept": "due_process",
      "complexity": "high"
    },
    {
      "text1": "The defendant breached the material terms of the contract by failing to deliver goods within the specified timeframe.",
      "text2": "Respondent violated essential contractual obligations through non-performance of delivery requirements.",
      "label": 0.92,
      "document_type": "litigation",
      "legal_concept": "breach_of_contract",
      "complexity": "medium"
    },
    {
      "text1": "This agreement shall be governed by and construed in accordance with the laws of the State of California.",
      "text2": "The interpretation and enforcement of this contract shall follow California state legal provisions.",
      "label": 0.89,
      "document_type": "contract",
      "legal_concept": "governing_law",
      "complexity": "low"
    },
    {
      "text1": "The court finds that the evidence was obtained in violation of the Fourth Amendment and must be excluded.",
      "text2": "Illegally seized evidence violates constitutional protections and is inadmissible in criminal proceedings.",
      "label": 0.87,
      "document_type": "case_law",
      "legal_concept": "exclusionary_rule",
      "complexity": "high"
    },
    {
      "text1": "Landlord shall maintain the premises in good repair and habitable condition throughout the lease term.",
      "text2": "Property owner must ensure rental unit remains safe and livable during tenancy period.",
      "label": 0.84,
      "document_type": "lease",
      "legal_concept": "habitability",
      "complexity": "medium"
    },
    {
      "text1": "The corporation is authorized to issue up to 10,000 shares of common stock with a par value of $1.00 per share.",
      "text2": "The recipe requires three cups of flour, two eggs, and one tablespoon of vanilla extract.",
      "label": 0.02,
      "document_type": "mixed",
      "legal_concept": "unrelated",
      "complexity": "unrelated"
    },
    {
      "text1": "Intellectual property rights, including patents, trademarks, and copyrights, shall remain with the original owner.",
      "text2": "All proprietary rights in inventions, marks, and creative works are retained by the initial rights holder.",
      "label": 0.91,
      "document_type": "contract",
      "legal_concept": "intellectual_property",
      "complexity": "medium"
    },
    {
      "text1": "The statute of limitations for filing a personal injury claim is two years from the date of the incident.",
      "text2": "Personal injury lawsuits must be commenced within twenty-four months of the occurrence giving rise to the claim.",
      "label": 0.93,
      "document_type": "statute",
      "legal_concept": "statute_of_limitations",
      "complexity": "medium"
    },
    {
      "text1": "Force majeure events include acts of God, war, terrorism, natural disasters, and government actions beyond the parties' control.",
      "text2": "Unforeseeable circumstances such as natural catastrophes, armed conflict, and regulatory changes constitute force majeure.",
      "label": 0.86,
      "document_type": "contract",
      "legal_concept": "force_majeure",
      "complexity": "medium"
    },
    {
      "text1": "The trustee shall exercise fiduciary duties and act in the best interests of the beneficiaries at all times.",
      "text2": "Trust administrator must maintain loyalty and care obligations toward trust beneficiaries in all decisions.",
      "label": 0.9,
      "document_type": "trust",
      "legal_concept": "fiduciary_duty",
      "complexity": "high"
    },
    {
      "text1": "Confidential information disclosed during negotiations shall not be shared with third parties without written consent.",
      "text2": "Non-disclosure obligations prevent revelation of proprietary data to external entities absent express authorization.",
      "label": 0.88,
      "document_type": "nda",
      "legal_concept": "confidentiality",
      "complexity": "medium"
    }
  ]
}